## Data frame

In [2]:
import pandas as pd

In [3]:
df=pd.DataFrame()
type(df)

pandas.core.frame.DataFrame

In [4]:
ids=[100,120,130,140,150,160]
df=pd.DataFrame(ids)
df

     0
0  100
1  120
2  130
3  140
4  150
5  160

In [5]:
ids=[100,120,130,140,150,160]
df=pd.DataFrame(ids,columns=["ids"])
df

   ids
0  100
1  120
2  130
3  140
4  150
5  160

In [7]:
marks=[100,120,130,140,150,160]
names=["pavan","kumar","jp","simha","nikhil","tillu"]

df=pd.DataFrame(list(zip(names,marks)),
               columns=["names","marks"])
df

    names  marks
0   pavan    100
1   kumar    120
2      jp    130
3   simha    140
4  nikhil    150
5   tillu    160

In [9]:
marks=[100,120,130,140,150,160]
names=["pavan","kumar","jp","simha","nikhil","tillu"]
grades=["a","b","c","d","e","f"]

df=pd.DataFrame(list(zip(names,marks,grades)),
               columns=["names","marks","grades"])
df

    names  marks grades
0   pavan    100      a
1   kumar    120      b
2      jp    130      c
3   simha    140      d
4  nikhil    150      e
5   tillu    160      f

## create data drom dictionary

In [5]:
dict1={"names":["pavan","kumar","jp","narsimha","nikhil","tillu"],"marks":[100,120,130,140,150,160]}
df=pd.DataFrame(dict1)
df

      names  marks
0     pavan    100
1     kumar    120
2        jp    130
3  narsimha    140
4    nikhil    150
5     tillu    160

In [6]:
df["names"]

0       pavan
1       kumar
2          jp
3    narsimha
4      nikhil
5       tillu
Name: names, dtype: object

In [7]:
marks=[100,120,130,140,150,160]
names=["pavan","kumar","jp","narsimha","nikhil","tillu"]
grades=["a","b","c","d","e","f"]
address=["hyd","nzb","wrgl","mnchl","hyd2","tanda"]


df=pd.DataFrame(list(zip(names,marks,grades,address)),
               columns=["names","marks","grades","address"])
df

      names  marks grades address
0     pavan    100      a     hyd
1     kumar    120      b     nzb
2        jp    130      c    wrgl
3  narsimha    140      d   mnchl
4    nikhil    150      e    hyd2
5     tillu    160      f   tanda

In [9]:
print("column names",df["names"])

column names 0       pavan
1       kumar
2          jp
3    narsimha
4      nikhil
5       tillu
Name: names, dtype: object

### converting list of tuples to data frame

In [44]:
l1=[("pavan",2,"nzb"),("jp",3,"hyd"),("narsimha",4,"outoff")]
df2=pd.DataFrame(l1)
df2

          0  1       2
0     pavan  2     nzb
1        jp  3     hyd
2  narsimha  4  outoff

In [43]:
l1=[("pavan",35,"nzb"),("jp",38,"hyd"),("narsimha",45,"nlg")]
df2=pd.DataFrame(l1,columns=["names","marks","address"])
df2

      names  marks address
0     pavan     35     nzb
1        jp     38     hyd
2  narsimha     45     nlg

## Series

In [49]:
s=pd.Series([100,120,130,140,150,160])
type(s)

pandas.core.series.Series

In [50]:
s

0    100
1    120
2    130
3    140
4    150
5    160
dtype: int64

In [56]:
dict1={"names":["pavan","kumar","jp","narsimha","nikhil","tillu"],"marks":[100,120,130,140,150,160],"address":["hyd","nzb","nlg","hyd2","tanda","nzb2"]}

In [59]:
s1=pd.Series(dict1["names"])
s1

0       pavan
1       kumar
2          jp
3    narsimha
4      nikhil
5       tillu
dtype: object

In [61]:
s2=pd.Series(dict1)
s2

names      [pavan, kumar, jp, narsimha, nikhil, tillu]
marks                   [100, 120, 130, 140, 150, 160]
address             [hyd, nzb, nlg, hyd2, tanda, nzb2]
dtype: object

## xmple

In [72]:
s1=pd.Series(dict1["names"])
s2=pd.Series(dict1["marks"])
s3=pd.Series(dict1["address"])

In [73]:
ds=pd.concat([s1,s2,s3],axis=1)
ds

          0    1      2
0     pavan  100    hyd
1     kumar  120    nzb
2        jp  130    nlg
3  narsimha  140   hyd2
4    nikhil  150  tanda
5     tillu  160   nzb2

In [86]:
ds2=pd.DataFrame([s1,s2,s3])
ds2

       0      1    2         3       4      5
0  pavan  kumar   jp  narsimha  nikhil  tillu
1    100    120  130       140     150    160
2    hyd    nzb  nlg      hyd2   tanda   nzb2

In [85]:
ds1=pd.concat([s1,s2,s3],axis=0)
ds1

0       pavan
1       kumar
2          jp
3    narsimha
4      nikhil
5       tillu
0         100
1         120
2         130
3         140
4         150
5         160
0         hyd
1         nzb
2         nlg
3        hyd2
4       tanda
5        nzb2
dtype: object

###  file  saving  as csv file

In [88]:
path=r"C:\Users\DELL\DATA SCIENCE"

In [91]:
file_name=path+"\\pandas_convert1.csv"
print(file_name)

C:\Users\DELL\DATA SCIENCE\pandas_convert1.csv

In [92]:
ds2.to_csv(file_name)

### reverse processs from csv file to panda data frame

In [15]:
r=pd.read_csv(r"C:\Users\DELL\DATA SCIENCE\\pandas_convert12.csv")

In [16]:
r

   Unnamed: 0       0      1    2         3       4      5
0           0   pavan  kumar   jp  narsimha  nikhil  tillu
1           1     100    120  130       140     150    160
2           2     hyd    nzb  nlg      hyd2   tanda   nzb2
3           3  thanda   mike   jp       msk     snh    bdc
4           4     pop    hop  job       kim     tom    mom

In [17]:
len(r)

5

In [18]:
r1=[11,12,13,14,15]
print("length of list",len(r1))
s2=pd.Series(r1)
df5=pd.concat([r,s2],axis=1)

length of list 5

In [19]:
df5.to_csv(r"C:\Users\DELL\DATA SCIENCE\\pandas_convert122.csv")

In [12]:
pd.read_csv(r"C:\Users\DELL\DATA SCIENCE\\pandas_convert122.csv")

   Unnamed: 0  Unnamed: 0.1       0      1    2         3       4      5  0.1
0           0             0   pavan  kumar   jp  narsimha  nikhil  tillu   11
1           1             1     100    120  130       140     150    160   12
2           2             2     hyd    nzb  nlg      hyd2   tanda   nzb2   13
3           3             3  thanda   mike   jp       msk     snh    bdc   14
4           4             4     pop    hop  job       kim     tom    mom   15